# Блок завдань 1. Ітератори і генератори
#   10. Отримати список квадратів усіх чисел списку, які більше нуля. 

# Блок завдань 2. Декоратори
#   2. Написати декоратор, який заміряє час роботи функції. 

# Блок завдань 3. Лямбда-функції і функції вищих порядків
#   12. Додати кожному елементу списку число, введене користувачем (за допомогою map)

# Блок завдань 4. ООП
#   8. Реалізувати клас з методами для обчислення площі і периметра прямокутника 

# Блок завдань 5. Регулярні вирази
#   10. Перевірити правильність введення e-mail